// 80. Вывести на экран кодировку символов по ASCII(с 32 до 122)


for(char c='\u0021';c<='\u007A';c++)

 System.Console.Write($"{c,4}");

