//06. Написать программу вычисления значения функции y = sin(a). (Класс Math). 
System.Console.WriteLine("ВВедите значение a: ");
double a= Convert.ToDouble(Console.ReadLine());
double y = Math.Sin(a);
System.Console.WriteLine (y);